{
  "alternative_conceptions": {
    "AC1": {
      "id": "AC1",
      "name": "Circuito Abierto",
      "description": "El estudiante cree que circula corriente en un circuito abierto",
      "detailed_explanation": "Esta concepción alternativa ocurre cuando el estudiante no comprende que un interruptor abierto o una conexión interrumpida impide completamente el flujo de corriente. Incluye en sus cálculos componentes que están eléctricamente desconectados del resto del circuito.",
      "detection_patterns": [
        "Incluye resistencias desconectadas por interruptores abiertos",
        "Considera corrientes que fluyen a través de conexiones abiertas",
        "No reconoce que una rama abierta tiene corriente cero"
      ],
      "common_indicators": [
        "Menciona componentes aislados en cálculos",
        "Usa resistencias que no tienen continuidad eléctrica",
        "Calcula voltajes en nodos desconectados"
      ],
      "educational_strategy": "Enfatizar el concepto de continuidad eléctrica y camino cerrado para la corriente",
      "socratic_questions": [
        "¿Puede circular corriente sin un camino cerrado?",
        "¿Qué significa que un interruptor esté abierto?",
        "¿Cómo verificarías si hay continuidad eléctrica?"
      ]
    },
    "AC6": {
      "id": "AC6",
      "name": "Cortocircuito",
      "description": "No detecta que un cortocircuito evita el funcionamiento de componentes en paralelo",
      "detailed_explanation": "El estudiante no comprende que un cortocircuito (resistencia cero o conexión directa) crea un camino de resistencia mínima que deriva toda la corriente, efectivamente anulando componentes en paralelo.",
      "detection_patterns": [
        "Incluye resistencias en paralelo con cortocircuitos en cálculos",
        "No reconoce que un cortocircuito anula resistencias paralelas",
        "Calcula resistencias equivalentes incluyendo el cortocircuito como resistencia finita"
      ],
      "common_indicators": [
        "Menciona resistencias que están en paralelo con un cable",
        "Calcula corrientes a través de resistencias cortocircuitadas",
        "No identifica efectos de conexiones directas"
      ],
      "educational_strategy": "Explicar el concepto de camino de mínima resistencia y efectos del cortocircuito",
      "socratic_questions": [
        "¿Qué pasa cuando hay un cable directo en paralelo con una resistencia?",
        "¿Por qué camino preferirá circular la corriente?",
        "¿Cuál es la resistencia de un cable ideal?"
      ]
    },
    "AC9": {
      "id": "AC9",
      "name": "Razonamiento Local",
      "description": "Analiza componentes aislados sin considerar la visión global del circuito",
      "detailed_explanation": "El estudiante aplica leyes y fórmulas a componentes individuales sin considerar cómo estos interactúan con el resto del circuito. No tiene en cuenta efectos de carga, divisores de voltaje, o la topología completa del circuito.",
      "detection_patterns": [
        "Aplica V=IR a un componente usando el voltaje total de la fuente",
        "Ignora efectos de carga en divisores de voltaje",
        "No considera la influencia de otros componentes en el cálculo"
      ],
      "common_indicators": [
        "Usa voltaje de fuente directamente en resistencias intermedias",
        "Calcula como si cada componente estuviera aislado",
        "No considera resistencias equivalentes del resto del circuito"
      ],
      "educational_strategy": "Enseñar análisis sistemático del circuito completo y métodos nodales",
      "socratic_questions": [
        "¿Este componente está aislado o conectado a otros?",
        "¿Cómo afectan las otras resistencias a este cálculo?",
        "¿Cuál es el voltaje real en los terminales de este componente?"
      ]
    },
    "AC14": {
      "id": "AC14",
      "name": "Topología Serie/Paralelo",
      "description": "Confunde configuraciones serie versus paralelo en circuitos complejos",
      "detailed_explanation": "El estudiante tiene dificultades para identificar correctamente si los componentes están conectados en serie o en paralelo, especialmente en circuitos con topologías complejas o múltiples nodos.",
      "detection_patterns": [
        "Suma resistencias que están en paralelo como si estuvieran en serie",
        "Aplica fórmulas de paralelo a resistencias en serie",
        "Malinterpreta la topología de circuitos con múltiples nodos"
      ],
      "common_indicators": [
        "Suma todas las resistencias del circuito",
        "Usa fórmulas incorrectas para resistencias equivalentes",
        "Confunde conexiones de nodos"
      ],
      "educational_strategy": "Práctica con identificación de topologías y métodos de reducción de circuitos",
      "socratic_questions": [
        "¿Estos componentes comparten los mismos nodos?",
        "¿La corriente se divide o es la misma en ambos componentes?",
        "¿Cuál es la diferencia entre serie y paralelo?"
      ]
    },
    "AC2": {
      "id": "AC2", 
      "name": "Modelo de Atenuación",
      "description": "Cree que la corriente se atenúa o consume al pasar por las resistencias",
      "detailed_explanation": "El estudiante piensa que las resistencias 'consumen' o 'atenúan' la corriente, creyendo que la corriente disminuye conforme pasa por cada resistencia en serie, cuando en realidad la corriente es constante en un circuito serie.",
      "detection_patterns": [
        "Menciona que la corriente se consume en las resistencias",
        "Dice que la primera resistencia tiene más corriente",
        "Cree que la corriente disminuye progresivamente en serie"
      ],
      "common_indicators": [
        "Habla de consumo de corriente",
        "Menciona atenuación progresiva",
        "Identifica la primera resistencia como la de mayor corriente"
      ],
      "educational_strategy": "Explicar la conservación de la corriente y las leyes de Kirchhoff",
      "socratic_questions": [
        "¿Qué dice la primera ley de Kirchhoff sobre la corriente?",
        "¿Se puede 'consumir' o 'crear' corriente en una resistencia?",
        "¿Cómo es la corriente en todos los puntos de un circuito serie?"
      ]
    },
    "AC13": {
      "id": "AC13",
      "name": "Confusión V/I", 
      "description": "Confunde conceptos de voltaje y corriente en el análisis de circuitos",
      "detailed_explanation": "El estudiante confunde los conceptos de voltaje (diferencia de potencial) y corriente (flujo de carga), aplicando propiedades de uno al otro o mezclando sus comportamientos en el análisis de circuitos.",
      "detection_patterns": [
        "Aplica propiedades del voltaje a la corriente",
        "Confunde división de voltaje con división de corriente",
        "Mezcla conceptos de tensión y corriente en explicaciones"
      ],
      "common_indicators": [
        "Menciona 'voltaje que circula' o 'corriente en bornes'",
        "Confunde qué se divide en serie vs paralelo",
        "Usa indistintamente voltaje y corriente"
      ],
      "educational_strategy": "Reforzar diferencias fundamentales entre voltaje y corriente, y sus comportamientos específicos",
      "socratic_questions": [
        "¿Cuál es la diferencia entre voltaje y corriente?",
        "¿Qué se mantiene constante en serie: voltaje o corriente?",
        "¿Qué se divide en un circuito en paralelo?"
      ]
    }
  },
  "detection_criteria": {
    "scoring_system": {
      "perfect": 1.0,
      "partial": 0.5,
      "incorrect": 0.0
    },
    "evaluation_aspects": [
      "correct_ac_identification",
      "reasoning_quality",
      "conceptual_understanding",
      "systematic_analysis"
    ]
  },
  "tutoring_strategies": {
    "socratic_method": {
      "description": "Usar preguntas guía para ayudar al estudiante a descubrir conceptos",
      "rules": [
        "NUNCA dar respuestas directas",
        "Hacer preguntas que guíen hacia el concepto correcto",
        "Validar el razonamiento, no solo la respuesta",
        "Fomentar la explicación del proceso de pensamiento"
      ]
    },
    "conceptual_reinforcement": {
      "description": "Reforzar conceptos fundamentales antes de proceder",
      "techniques": [
        "Revisión de leyes básicas (Ohm, Kirchhoff)",
        "Analogías con sistemas conocidos",
        "Verificación de comprensión conceptual",
        "Conexión con experiencias previas"
      ]
    }
  }
}